---
kind: property
id: P:Autodesk.Revit.DB.Dimension.ValueOverride
zh: 尺寸标注、标注
source: html/4560ec6c-5aab-fcae-a64c-6f939ae06d94.htm
---
# Autodesk.Revit.DB.Dimension.ValueOverride Property

**中文**: 尺寸标注、标注

The text that replaces the segment's value.

## Syntax (C#)
```csharp
public string ValueOverride { get; set; }
```

## Remarks
This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.